c5/src/Documents/AssetsWriteOff/AssetsWriteOff.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>AssetsWriteOff</name>
  <basedOn>Document.AssetsInventory</basedOn>
  <registerRecords>AccumulationRegister.Expenses</registerRecords>
  <registerRecords>AccountingRegister.General</registerRecords>
  <attributes>
    <name>Amount</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </attributes>
  <attributes>
    <name>Approved</name>
    <type>
      <types>DefinedType.Member</types>
    </type>
  </attributes>
  <attributes>
    <name>ApprovedPosition</name>
    <type>
      <types>DefinedType.MemberPosition</types>
    </type>
  </attributes>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>Creator</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Currency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </attributes>
  <attributes>
    <name>Detail</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Dim1</name>
    <type>
      <types>Characteristic.Dimensions</types>
    </type>
  </attributes>
  <attributes>
    <name>Dim2</name>
    <type>
      <types>Characteristic.Dimensions</types>
    </type>
  </attributes>
  <attributes>
    <name>Dim3</name>
    <type>
      <types>Characteristic.Dimensions</types>
    </type>
  </attributes>
  <attributes>
    <name>ExpenseAccount</name>
    <type>
      <types>ChartOfAccountsRef.General</types>
    </type>
  </attributes>
  <attributes>
    <name>Factor</name>
    <type>
      <types>DefinedType.Factor</types>
    </type>
  </attributes>
  <attributes>
    <name>GrossAmount</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </attributes>
  <attributes>
    <name>Head</name>
    <type>
      <types>DefinedType.Member</types>
    </type>
  </attributes>
  <attributes>
    <name>HeadPosition</name>
    <type>
      <types>DefinedType.MemberPosition</types>
    </type>
  </attributes>
  <attributes>
    <name>Inventory</name>
    <type>
      <types>DocumentRef.AssetsInventory</types>
    </type>
  </attributes>
  <attributes>
    <name>Memo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Product</name>
    <type>
      <types>CatalogRef.Items</types>
    </type>
  </attributes>
  <attributes>
    <name>ProductFeature</name>
    <type>
      <types>CatalogRef.Features</types>
    </type>
  </attributes>
  <attributes>
    <name>Rate</name>
    <type>
      <types>DefinedType.Rate</types>
    </type>
  </attributes>
  <attributes>
    <name>ShowPrices</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Tax</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </attributes>
  <attributes>
    <name>Taxable</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>TaxableAmount</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </attributes>
  <attributes>
    <name>TaxCode</name>
    <type>
      <types>CatalogRef.TaxCodes</types>
    </type>
  </attributes>
  <attributes>
    <name>TaxGroup</name>
    <type>
      <types>CatalogRef.TaxGroups</types>
    </type>
  </attributes>
  <attributes>
    <name>TaxRate</name>
    <type>
      <types>DefinedType.TaxRate</types>
    </type>
  </attributes>
  <attributes>
    <name>VAT</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </attributes>
  <attributes>
    <name>VATUse</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Items</name>
    <attributes>
      <name>Amount</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>Dim1</name>
      <type>
        <types>Characteristic.Dimensions</types>
      </type>
    </attributes>
    <attributes>
      <name>Dim2</name>
      <type>
        <types>Characteristic.Dimensions</types>
      </type>
    </attributes>
    <attributes>
      <name>Dim3</name>
      <type>
        <types>Characteristic.Dimensions</types>
      </type>
    </attributes>
    <attributes>
      <name>ExpenseAccount</name>
      <type>
        <types>ChartOfAccountsRef.General</types>
      </type>
    </attributes>
    <attributes>
      <name>Item</name>
      <type>
        <types>CatalogRef.FixedAssets</types>
      </type>
    </attributes>
    <attributes>
      <name>Product</name>
      <type>
        <types>CatalogRef.Items</types>
      </type>
    </attributes>
    <attributes>
      <name>ProductFeature</name>
      <type>
        <types>CatalogRef.Features</types>
      </type>
    </attributes>
    <attributes>
      <name>Taxable</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>TaxableAmount</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>TaxCode</name>
      <type>
        <types>CatalogRef.TaxCodes</types>
      </type>
    </attributes>
    <attributes>
      <name>Total</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>VAT</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>VATCode</name>
      <type>
        <types>CatalogRef.VAT</types>
      </type>
    </attributes>
    <attributes>
      <name>VATRate</name>
      <type>
        <types>DefinedType.TaxRate</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Members</name>
    <attributes>
      <name>Member</name>
      <type>
        <types>DefinedType.Member</types>
      </type>
    </attributes>
    <attributes>
      <name>Position</name>
      <type>
        <types>DefinedType.MemberPosition</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Taxes</name>
    <attributes>
      <name>Amount</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>Percent</name>
      <type>
        <types>DefinedType.TaxRate</types>
      </type>
    </attributes>
    <attributes>
      <name>Tax</name>
      <type>
        <types>CatalogRef.TaxItems</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

c5/src/AccountingRegisters/General/General.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>General</name>
  <chartOfAccounts>ChartOfAccounts.General</chartOfAccounts>
  <correspondence>true</correspondence>
  <dimensions>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
    <balance>true</balance>
  </dimensions>
  <dimensions>
    <name>Currency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
    <accountingFlag>ChartOfAccounts.General.AccountingFlag.Currency</accountingFlag>
  </dimensions>
  <resources>
    <name>Quantity</name>
    <type>
      <types>DefinedType.Quantity</types>
    </type>
    <accountingFlag>ChartOfAccounts.General.AccountingFlag.Quantitative</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.General.ExtDimensionAccountingFlag.Quantitative</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>Amount</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
    <balance>true</balance>
    <extDimensionAccountingFlag>ChartOfAccounts.General.ExtDimensionAccountingFlag.Accrual</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>CurrencyAmount</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
    <accountingFlag>ChartOfAccounts.General.AccountingFlag.Currency</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.General.ExtDimensionAccountingFlag.Currency</extDimensionAccountingFlag>
  </resources>
  <attributes>
    <name>Content</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Operation</name>
    <type>
      <types>EnumRef.Operations</types>
    </type>
  </attributes>
  <attributes>
    <name>Dependency</name>
    <type>
      <types>DocumentRef.Payment</types>
      <types>DocumentRef.VendorInvoice</types>
      <types>DocumentRef.CustomsDeclaration</types>
      <types>DocumentRef.Production</types>
    </type>
  </attributes>
</mdclass:AccountingRegister>

c5/src/InformationRegisters/Depreciation/Depreciation.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Depreciation</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Acceleration</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Charge</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Expenses</name>
    <type>
      <types>CatalogRef.ExpenseMethods</types>
    </type>
  </resources>
  <resources>
    <name>LiquidationValue</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </resources>
  <resources>
    <name>Method</name>
    <type>
      <types>EnumRef.Amortization</types>
    </type>
  </resources>
  <resources>
    <name>Schedule</name>
    <type>
      <types>CatalogRef.DepreciationSchedules</types>
    </type>
  </resources>
  <resources>
    <name>Starting</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>UsefulLife</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Asset</name>
    <type>
      <types>CatalogRef.FixedAssets</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

c5/src/Catalogs/Contacts/Contacts.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Contacts</name>
  <basedOn>Catalog.Leads</basedOn>
  <owners>Catalog.Companies</owners>
  <owners>Catalog.Organizations</owners>
  <owners>Catalog.Warehouses</owners>
  <owners>Catalog.Leads</owners>
  <attributes>
    <name>AdditionalPhone</name>
    <type>
      <types>DefinedType.Phone</types>
    </type>
  </attributes>
  <attributes>
    <name>Birthday</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>BusinessPhone</name>
    <type>
      <types>DefinedType.Phone</types>
    </type>
  </attributes>
  <attributes>
    <name>Contact</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ContactType</name>
    <type>
      <types>CatalogRef.ContactTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>Creator</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Date</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Email</name>
    <type>
      <types>DefinedType.Email</types>
    </type>
  </attributes>
  <attributes>
    <name>Fax</name>
    <type>
      <types>DefinedType.Phone</types>
    </type>
  </attributes>
  <attributes>
    <name>FirstName</name>
    <type>
      <types>DefinedType.Name</types>
    </type>
  </attributes>
  <attributes>
    <name>Gender</name>
    <type>
      <types>EnumRef.Sex</types>
    </type>
  </attributes>
  <attributes>
    <name>HomePhone</name>
    <type>
      <types>DefinedType.Phone</types>
    </type>
  </attributes>
  <attributes>
    <name>LastName</name>
    <type>
      <types>DefinedType.Name</types>
    </type>
  </attributes>
  <attributes>
    <name>Lead</name>
    <type>
      <types>CatalogRef.Leads</types>
    </type>
  </attributes>
  <attributes>
    <name>MobilePhone</name>
    <type>
      <types>DefinedType.Phone</types>
    </type>
  </attributes>
  <attributes>
    <name>Name</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Patronymic</name>
    <type>
      <types>DefinedType.Name</types>
    </type>
  </attributes>
  <attributes>
    <name>Salutation</name>
    <type>
      <types>CatalogRef.Salutations</types>
    </type>
  </attributes>
  <attributes>
    <name>Skype</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Twitter</name>
    <type>
      <types>DefinedType.Twitter</types>
    </type>
  </attributes>
  <attributes>
    <name>Web</name>
    <type>
      <types>DefinedType.Web</types>
    </type>
  </attributes>
</mdclass:Catalog>

c5/src/Documents/AssetsWriteOff/ManagerModule.bsl
#if ( Server or ThickClientOrdinaryApplication or ExternalConnection ) then

Procedure PresentationGetProcessing ( Data, Presentation, StandardProcessing )
	
	StandardProcessing = false;
	Presentation = Metadata.Documents.AssetsWriteOff.Synonym + " #" + Data.Number + " " + Format ( Data.Date, "DLF=D" );
	
EndProcedure
	
Procedure PresentationFieldsGetProcessing ( Fields, StandardProcessing )
	
	StandardProcessing = false;
	Fields.Add ( "Date" );
	Fields.Add ( "Number" );
	
EndProcedure

#region Printing

Function Print ( Params, Env ) export
	
	Print.SetFooter ( Params.TabDoc );
	setPageSettings ( Params );
	getPrintData ( Params, Env );
	if ( Params.Name = "MF3" ) then
		putHeader1Page1 ( Params, Env );
		putMemberRow ( Params, Env, 1 );
		putRowPage1 ( Params, Env );
		putFooterPage1 ( Params, Env );
		putHeader1Page2 ( Params, Env );
		putMemberRow ( Params, Env, 2 );
		putFooterPage2 ( Params, Env );
	else
		putHeader ( Params, Env );
		putTable ( Params, Env );
		putFooter ( Params, Env );
	endif;
	return true;
	
EndFunction
 
Procedure setPageSettings ( Params )
	
	tabDoc = Params.TabDoc;
	tabDoc.PageOrientation = PageOrientation.Portrait;
	tabDoc.FitToPage = true;
	
EndProcedure 

Procedure getPrintData ( Params, Env )
	
	SetPrivilegedMode ( true );
	ref = Params.Reference;
	if ( Params.Name = "MF3" ) then
		sqlDataMF3 ( Env );
	else
		sqlPrintData ( Env );
	endif;
	sqlMembers ( Env );
	q = Env.Q;
	q.SetParameter ( "Ref", ref );
	q.SetParameter ( "Date", ref.Date );
	SQL.Perform ( Env );
	SetPrivilegedMode ( false );
	
EndProcedure

Procedure sqlPrintData ( Env )
	
	s = "
	|// @Fields
	|select Documents.Number as Number, Documents.Date as Date, Documents.Company.FullDescription as Company,
	|	presentation ( Documents.Approved ) as Approved, presentation ( Documents.ApprovedPosition ) as Position,
	|	presentation ( Documents.Head ) as Head, presentation ( Documents.HeadPosition ) as HeadPosition,
	|	Documents.Memo as Memo
	|from Document.AssetsWriteOff as Documents
	|where Documents.Ref = &Ref
	|;
	|select Items.Item Item, Items.Item.Unit.Code as Unit, 1 as Quantity, min ( LineNumber ) as LineNumber
	|into Items
	|from Document.AssetsWriteOff.Items as Items
	|where Items.Ref = &Ref
	|group by Items.Item, Items.Item.Unit.Code	
	|;
	|// #Items
	|select Items.LineNumber as LineNumber, Items.Item.Description as Item, Items.Item.Code as Code,
	|	Items.Unit as Unit, Items.Quantity as Quantity, General.AmountBalanceDr as Cost, General.AmountBalanceDr as Amount
	|from Items as Items
	|	//
	|	// General
	|	//
	|	left join AccountingRegister.General.Balance ( &Date ) as General
	|	on Items.Item = General.ExtDimension1
	|	and Items.Item.Account = General.Account
	|";
	Env.Selection.Add ( s );    
	
EndProcedure

Procedure putHeader ( Params, Env )
	
	area = Env.T.GetArea ( "Header" );
	area.Parameters.Fill ( Env.Fields );
	Params.TabDoc.Put ( area );
	
EndProcedure
 
Procedure putTable ( Params, Env )
	
	t = Env.T;
	header = t.GetArea ( "Table" );
	area = t.GetArea ( "Row" );
	header.Parameters.Fill ( Env.Fields );
	tabDoc = Params.TabDoc;
	tabDoc.Put ( header );
	Print.Repeat ( tabDoc );
	table = Env.Items;
	accuracy = Application.Accuracy ();
	p = area.Parameters;
	for each row in table do
		p.Fill ( row );
		p.Quantity = Format ( row.Quantity, accuracy );
		tabDoc.Put ( area );
	enddo;
	Env.Insert ( "AmountTotal", table.Total ( "Amount" ) );
	
EndProcedure

Procedure putFooter ( Params, Env )
	
	putTotals ( Params, Env );
	tabDoc = Params.TabDoc;
	startStaing = tabDoc.TableHeight + 1;
	putHead ( Params, Env );
	putMembers ( Params, Env );
	tabDoc.Area ( startStaing, , tabDoc.TableHeight ).StayWithNext = true;
	
EndProcedure

Procedure putTotals ( Params, Env )
	
	area = Env.T.GetArea ( "Totals" );
	p = area.Parameters;
	p.Fill ( Env.Fields );
	p.Amount = Env.AmountTotal;
	Params.TabDoc.Put ( area );        
	
EndProcedure 

Procedure putHead ( Params, Env )
	
	area = Env.T.GetArea ( "Head" );
	p = area.Parameters;
	p.Fill ( Env.Fields );
	p.AmountInWords = NumberInWords ( Env.AmountTotal, ? ( Params.SelectedLanguage = "en", "L = en_EN", "L = ru_RU" ) );
	Params.TabDoc.Put ( area );        
	
EndProcedure 

Procedure putMembers ( Params, Env )
	
	members = Env.Members;
	if ( members.Count () = 0 ) then
		return;
	endif; 
	tabDoc = Params.TabDoc;
	t = Env.T;
	tabDoc.Put ( t.GetArea ( "MembersHeader" ) );
	area = t.GetArea ( "MembersRow" );
	p = area.Parameters;
	for each row in members do
		p.Fill ( row );
		tabDoc.Put ( area );
	enddo; 
	
EndProcedure

Procedure sqlDataMF3 ( Env )
	
	s = "
	|// @Fields
	|select Documents.Number as Number, Documents.Date as Date, Documents.Company.FullDescription as Company, Documents.Company.CodeFiscal as CodeFiscal,
	|	Contacts.Name as Accountant, presentation ( Documents.Approved ) as Approved, presentation ( Documents.ApprovedPosition ) as ApprovedPosition, 
	|	presentation ( Documents.Head ) as Head, presentation ( Documents.HeadPosition ) as HeadPosition
	|from Document.AssetsWriteOff as Documents
	|	//
	|	// Contacts
	|	//
	|	left join Catalog.Contacts as Contacts
	|	on Contacts.ContactType = value ( Catalog.ContactTypes.Accountant )
	|	and Contacts.Owner = Documents.Company
	|where Documents.Ref = &Ref
	|;
	|// Items
	|select Items.Item as Asset, Items.Item.Inventory as Inventory, Items.LineNumber as LineNumber
	|into Items
	|from Document.AssetsWriteOff.Items as Items
	|where Items.Ref = &Ref
	|;
	|// General
	|select Items.Asset as Asset, General.Account as Account, General.AmountBalanceDr as InitialCost, General.AmountBalanceCr as AccumulatedAmortization
	|into General
	|from Items as Items
	|	//
	|	// General
	|	//
	|	inner join AccountingRegister.General.Balance ( &Date ) as General
	|	on Items.Asset = General.ExtDimension1
	|	and ( Items.Asset.Account = General.Account or Items.Asset.DepreciationAccount = General.Account )
	|;
	|// GeneralGrouped
	|select General.Asset as Asset, sum ( General.InitialCost ) as InitialCost, sum ( General.AccumulatedAmortization ) as AccumulatedAmortization
	|into GeneralGrouped
	|from General
	|group by General.Asset
	|;
	|// #Items
	|select Items.Asset.Description as Asset, Items.Inventory as Inventory, Depreciation.UsefulLife as UsefulLife, 
	|	isnull ( General.InitialCost, 0 ) as InitialCost, isnull ( General.AccumulatedAmortization, 0 ) as AccumulatedAmortization,
	|	( isnull ( General.InitialCost, 0 ) - Depreciation.LiquidationValue ) / Depreciation.UsefulLife as Amortization, 
	|	Depreciation.Recorder.Date as ExploitationDate
	|from Items as Items
	|	//
	|	// Depreciation
	|	//
	|	left join InformationRegister.Depreciation.SliceLast ( &Date ) as Depreciation
	|	on Items.Asset = Depreciation.Asset
	|	//
	|	// General
	|	//
	|	left join GeneralGrouped as General
	|	on Items.Asset = General.Asset
	|order by Items.LineNumber
	|";
	Env.Selection.Add ( s );    
	
EndProcedure

Procedure sqlMembers ( Env ) 

	s = "
	|// #Members
	|select presentation ( Members.Member ) as Member, presentation ( Members.Position ) as Position
	|from Document.AssetsWriteOff.Members as Members
	|where Members.Ref = &Ref
	|order by Members.LineNumber
	|";
	Env.Selection.Add ( s );    

EndProcedure

Procedure putHeader1Page1 ( Params, Env ) 

	area = Env.T.GetArea ( "Header1Page1" );
	p = area.Parameters;
	fields = Env.Fields;
	p.Fill ( fields );
	p.Date = Format ( fields.Date, "L=ro_RO; DLF=DD" );
	Params.TabDoc.Put ( area );

EndProcedure

Procedure putMemberRow ( Params, Env, Page )
	
	members = Env.Members;
	if ( members.Count () = 0 ) then
		return;
	endif;
	t = Env.T;
	if ( Page = 1 ) then
		areaFirst = t.GetArea ( "MemberRow1First" );
		area = t.GetArea ( "MemberRow1" );
	else
		areaFirst = t.GetArea ( "MemberRow2First" );
		area = t.GetArea ( "MemberRow2" );
	endif;
	tabDoc = Params.TabDoc;
	first = true;
	for each row in members do
		if ( first ) then
			areaToPut = areaFirst;
			first = false;
		else
			areaToPut = area;
		endif;
		areaToPut.Parameters.Fill ( row );
		tabDoc.Put ( areaToPut );
	enddo;
	
EndProcedure

Procedure putRowPage1 ( Params, Env )
	
	t = Env.T;
	tabDoc = Params.TabDoc;
	tabDoc.Put ( t.GetArea ( "Header2Page1" ) );
	area = t.GetArea ( "RowPage1" );
	p = area.Parameters;
	table = Env.Items;
	line = 1;
	initialCost = 0;
	accumulatedAmortization = 0;
	amortization = 0;
	for each row in table do
		p.Fill ( row );
		p.LineNumber = line;
		line = line + 1;
		tabDoc.Put ( area );
		initialCost = initialCost + row.InitialCost;
		accumulatedAmortization = accumulatedAmortization + row.AccumulatedAmortization;
		amortization = amortization + row.Amortization;
	enddo;
	Env.Insert ( "InitialCost", initialCost );
	Env.Insert ( "AccumulatedAmortization", accumulatedAmortization );
	Env.Insert ( "Amortization", amortization );
	
EndProcedure

Procedure putFooterPage1 ( Params, Env ) 

	area = Env.T.GetArea ( "FooterPage1" );
	p = area.Parameters;
	p.Fill ( Env );
	tabDoc = Params.TabDoc;
	tabDoc.Put ( area );
	tabDoc.PutHorizontalPageBreak ();

EndProcedure

Procedure putHeader1Page2 ( Params, Env ) 

	area = Env.T.GetArea ( "Header1Page2" );
	p = area.Parameters;
	p.Head = Env.Fields.Head;
	cost = Env.InitialCost;
	amount = Conversion.AmountToWords ( cost );
	amount = StrReplace ( amount, "Noăzeci", "Nouăzeci" );
	amount = StrReplace ( amount, "o sută",	"una sută" );
	p.SumInWordsAndNumbers = Format ( cost, "NFD=2" ) + "  (" + amount + ")"; 
	Params.TabDoc.Put ( area );

EndProcedure

Procedure putFooterPage2 ( Params, Env ) 

	area = Env.T.GetArea ( "FooterPage2" );
	p = area.Parameters;
	fields = Env.Fields;
	p.Fill ( fields );
	Params.TabDoc.Put ( area );

EndProcedure

#endregion

#endif
